s1 = float(input("Введіть продажі менеджера 1: "))
s2 = float(input("Введіть продажі менеджера 2: "))
s3 = float(input("Введіть продажі менеджера 3: "))
if s1 < 500:
    z1 = 200 + s1 * 0.03
elif s1 <= 1000:
    z1 = 200 + s1 * 0.05
else:
    z1 = 200 + s1 * 0.08
if s2 < 500:
    z2 = 200 + s2 * 0.03
elif s2 <= 1000:
    z2 = 200 + s2 * 0.05
else:
    z2 = 200 + s2 * 0.08
if s3 < 500:
    z3 = 200 + s3 * 0.03
elif s3 <= 1000:
    z3 = 200 + s3 * 0.05
else:
    z3 = 200 + s3 * 0.08

if s1 >= s2 and s1 >= s3:
    z1 = z1 + 200
    best = 1
elif s2 >= s1 and s2 >= s3:
    z2 = z2 + 200
    best = 2
else:
    z3 = z3 + 200
    best = 3

print("Зарплата менеджера 1:", z1)
print("Зарплата менеджера 2:", z2)
print("Зарплата менеджера 3:", z3)
print("Найкращий менеджер:", best)
